Repository: nextgis/nextgismanager
Catalog: opt/loc/*/geoprocessing.po
Languages: ru

source: Compute statistics
ru: Собрать статистику

source: Data Management Tools/Raster
ru: Управление данными/Растр

source: Source raster
ru: Исходный растр

source: Compute statistics based on overviews or a subset of all tiles
ru: Собрать статистику с использованием пирамид или всех фрагментов растра

source: Unexpected error occurred
ru: Неожиданная ошибка

source: Error getting catalog object
ru: Ошибка получения объекта каталога

source: Error getting source object
ru: Ошибка получения исходного объекта

source: Source object is of incompatible type
ru: Исходный объект несовместимого типа

source: Source dataset is of incompatible type
ru: Исходный набор данных несовместимого типа

source: Error getting raster
ru: Ошибка получения растра

source: Proceed band %d
ru: Обработка канала %d

source: ComputeStatistics failed! GDAL error: %s
ru: ComputeStatistics завершилось неудачно! Ошибка GDAL: %s

source: Band %d: min - %.2f, max - %.2f, mean - %.2f, StdDev - %.2f
ru: Канал %d: мин. - %.2f, макс. - %.2f, ср. - %.2f, стд. откл. - %.2f

source: Create overviews
ru: Создать пирамиды

source: Pixel interpolation
ru: Интерполяция пикселов

source: Nearest
ru: Ближайшее

source: Gauss
ru: Гаусс

source: Cubic
ru: Кубическая

source: Average
ru: Среднее

source: Mode
ru: Мода

source: Average magphase
ru: Средневзвешенное

source: None
ru: Нет

source: Overview compression
ru: Сжатие пирамид

source: Overview levels
ru: Уровни пирамид

source: The GxCatalog is undefined type (not inherited from IGxObjectContainer)
ru: Не определенный тип GxCatalog (неунаследовано от IGxObjectContainer)

source: There is no GxObject for path %s
ru: Отсутствует GxObject по пути %s

source: The input path is not GxDataset (Path %s)
ru: Входной путь не является объектом GxDataset (Путь %s)

source: The input path is not RasterDataset (Path %s)
ru: Входной путь не является объектом RasterDataset (Путь %s)

source: Failed open input path: %s
ru: Ошибка открытия входного пути: %s

source: The levels list is empty
ru: Список уровней пуст

source: BuildOverviews failed! GDAL error: %s
ru: BuildOverviews завершилось неудачно! Ошибка GDAL: %s

source: Export vector file (single)
ru: Экспорт векторного файла (одного)

source: Conversion Tools/Vector
ru: Инструменты преобразования/Вектор

source: Source feature class
ru: Исходный класс пространственных объектов

source: Destination feature class
ru: Конечный класс пространственных объектов

source: Cannot export to the same format
ru: Невозможно экспортировать в тот же формат

source: Error get source object
ru: Ошибка получения исходного объекта

source: The source object is of incompatible type
ru: Исходный объект несовместимого типа

source: The source dataset is of incompatible type
ru: Исходный набор данных несовместимого типа

source: Error reading dataset definition
ru: Ошибка чтения определения набора данных

source: Error getting selected destination filter
ru: Ошибка получения выбранного фильтра

source: Geometry Vertices To Points
ru: Вершины геометрии в точки

source: Create Ortho-Corrected Raster
ru: Создать ортокорректированный растр

source: Destination raster
ru: Выходной растр

source: Output raster interpolation
ru: Интерполяция выходного растра

source: Nearest neighbour (select on one input pixel)
ru: Ближайший сосед (выбор одного из входных пикселов)

source: Bilinear (2x2 kernel)
ru: Билиненая (маска 2x2)

source: Cubic Convolution Approximation (4x4 kernel)
ru: Кубическая апроксимация (маска 4х4)

source: Cubic B-Spline Approximation (4x4 kernel)
ru: Кубическая B-Spline апроксимация (маска 4x4)

source: Lanczos windowed sinc interpolation (6x6 kernel)
ru: Интерполяция Lanczos (маска 6х6)

source: DEM raster
ru: Растр ЦМР

source: Constant elevation value or base value to the DEM
ru: Постоянная высота или базовое значение относительно ЦМР

source: Scaling factor to convert elevation values
ru: Параметр масштабирования для пересчета высот

source: Elevation values interpolation
ru: Интерполяция значений высот

source: Nearest Neighbour
ru: Ближайший сосед

source: Bilinear
ru: Билинейная

source: Geoid correction
ru: Коррекция геоида

source: Error get destination object
ru: Ошибка получения выходного объекта

source: The raster has no bands
ru: Растр без каналов

source: Error getting output Spatial Reference (input Spatial Reference undefined)
ru: Ошибка получения выходной системы координат (входная система координат не определена)

source: Error getting geoid correction. PROJ4 error: %s
ru: Ошибка получения коррекции геоида! Ошибка PROJ4: %s

source: Geoid correction value set to %.3f m
ru: Коррекция геоида установлена в %.3f м

source: Error CreateGenImgProjTransformer. GDAL Error: %s
ru: Ошибка CreateGenImgProjTransformer. Ошибка GDAL: %s

source: Error determining output raster size. GDAL Error: %s
ru: Ошибка определение размера выходого растра. Ошибка GDAL: %s

source: Error creating output raster. GDAL Error: %s
ru: Ошибка создания выходного растра. Ошибка GDAL: %s

source: The dfWarpMemoryLimit set to %f Mb
ru: Значение dfWarpMemoryLimit установлено %f Мб

source: Using internal nodata values (eg. nan) for source image
ru: Использование внутренних значений нет данных (т.е. nan) для входного изображения

source: Using internal nodata values (eg. %g) for source image
ru: Использование внутренних значений нет данных (т.е. %g) для входного изображения

source: For band %d, destination nodata value has been clamped to %.0f, the original value being out of range
ru: Для канала %d выходное значение нет данных установлено в %.0f, оригинальное значение выходит за допустимый предел

source: OrthoCorrect failed! GDAL error: %s
ru: OrthoCorrect завершилось неудачно! Ошибка GDAL: %s

source: Project vector file (single)
ru: Проецирование векторного файла (одного)

source: Projections and Transformations/Vector
ru: Проекции и преобразования/Вектор

source: Spatial reference
ru: Система координат

source: Unsupported Spatial Reference
ru: Система координат не поддерживается

source: Source vector dataset open failed
ru: Не удалось открыть входной векторный источник данных

source: Source raster dataset open failed
ru: Не удалось открыть входной растровый источник данных

source: Create OGRCreateCoordinateTransformation failed! GDAL error: %s
ru: Не удалось создать OGRCreateCoordinateTransformation! Ошибка GDAL: %s

source: Start clip '%s' by geometry from '%s'
ru: Начало обрезки '%s' геометрией из '%s'

source: Input file has no bands, and so cannot be translated.
ru: Входной файл не содержит каналов и не может быть преобразован

source: Band %d requested, but only bands 1 to %d available.
ru: Запрошен канал %d, но доступны только каналы 1 - %d

source: Output driver '%s' not recognised.
ru: Выходной драйвер '%s' не определяется.

source: Interrupted by user
ru: Прервано пользователем

source: Get raster failed
ru: Не удалось получить растр

source: The geotransform is rotated. This configuration is not supported.
ru: Матрица трансформирования повернута. Конфигурация не поддерживается.

source: Computed source pixel window %d %d %d %d from geographic window.
ru: Рассчитанное выходное окно %d %d %d %d из географических координат.

source: Computed source pixel window falls outside raster size of %dx%d.
ru: Рассчитанное выходное окно выходит за границы растра %dx%d.

source: GDALFlushCache failed!
ru: Ошибка GDALFlushCache!

source: Write shapes coordinates to text file
ru: Записать координаты фигур в текстовый файл

source: Source table
ru: Исходная таблица

source: Coordinates format mask to write to text file
ru: Шаблон вывода координат для записи в текстовый файл

source: Swap XY coordinates
ru: Поменять местами координаты XY

source: Destination text file
ru: Выходной текстовый файл

source: Text file
ru: Текстовый файл

source: Invalid format mask
ru: Не правильный шаблон

source: Create subraster by vector cutline
ru: Поучение области растра по векторной границе

source: Source vector
ru: Исходный векторный файл

source: Destination folder
ru: Выходной каталог

source: Error getting source vector object
ru: Ошибка получения исходного ветороного файла

source: Source vector dataset is of incompatible type
ru: Исходный набор веторных данных несовместимого типа

source: Error getting source raster object
ru: Ошибка получения исходного растра

source: Source raster dataset is of incompatible type
ru: Исходный набор растровых данных несовместимого типа

source: Calculate mean column data
ru: Рассчитать среднее значение поля

source: Statistics Tools/Table
ru: Статистические инструменты/Таблица

source: Source fields and operations
ru: Исходные поля и операции

source: Field name
ru: Имя поля

source: Operation
ru: Операция

source: Destination table
ru: Выходная таблица

source: The input path is not wxGISTable (Path %s)
ru: Входной файл не является wxGISTable (Путь %s)

source: Failed get table structure (Path %s)
ru: Невозможно получить структуру таблицы (Путь %s)

source: Exclude field
ru: Исключить поле

source: Base field
ru: Базовое поле

source: Mean value
ru: Среднее значение

source: Minimum value
ru: Максимальное значение

source: Maximum value
ru: Минимальное значение

source: Sum of values
ru: Сумма значений

source: The base field count should be 1 (current count is %d)
ru: Количество базовых полей должно быть равно 1 (текущее количество %d)

source: The driver '%s' is not available! OGR error:
ru: Драйвер '%s' недоступен! Ошибка OGR:

source: Error create the output file '%s'! OGR error:
ru: Ошибка создания выходного файла '%s'! Ошибка OGR:

source: Layer_
ru: Слой_

source: Error create the output layer '%s'! OGR error:
ru: Ошибка создания выходного слоя '%s'! Ошибка OGR:

source: Calculate mean values for columns. Source dataset %s. Destination dataset %s
ru: Расчитать среднее значение колонок. Исходный источник %s. Выходной источник %s

source: Error creating new dataset! OGR error:
ru: Ошибка создания нового набора данных! Ошибка OGR:

source: Remains
ru: Осталось

source: %H hour(s) %M min. %S sec.
ru: %H час. %M мин. %S сек.

source: Create %s object failed!
ru: Не удалось создать объект %s!

source: Executing (%s)
ru: Выполнение (%s)

source: Parameters:
ru: Параметры:

source: Start Time: %s
ru: Начало: %s

source: An error occured while executing %s. Failed to execute (%s).
ru: Ошибка в процессе выполнения %s. Невозможно выполнить (%s).

source: Error!
ru: Ошибка!

source: Executed (%s) successfully
ru: Выполнение (%s) успешно завершено

source: Done
ru: Завершено

source: End Time: %s (Elapsed Time: %s)
ru: Окончание: %s (Заняло: %s)

source: %H hours %M min. %S sec.
ru: %H час. %M мин. %S сек.

source: Input dataset is corrupt
ru: Входные данные повреждены

source: Error create feature! Source feature FID:%d OGR error:
ru: Ошибка создания записи! Идентификатор записи:%d Ошибка OGR:

source: Geometry transform failed Feature id %d
ru: Ошибка преобразования геометрий Идентификатор записи %d

source: Start copy records from '%s' to '%s'
ru: Начало копирования записей из '%s' в '%s'

source: Start copy records from '%s' to '%s' WHERE %s
ru: Начало копирования записей из '%s' в '%s' WHERE %s

source: No records to export
ru: Нет записей для экспорта

source: Error creating new dataset! OGR error:
ru: Ошибка создания нового набора данных! Ошибка OGR:

source: Error copying data to a new dataset! OGR error:
ru: Ошибка копирования данных в новый набор! Ошибка OGR:

source: Overwrite failed
ru: Не удалось перезаписать

source: Exporting %s to %s
ru: Экспорт %s в %s

source: Error read dataset definition
ru: Ошибка чтения определения набора данных

source: Get features...
ru: Получение записей...

source: Input spatial reference is not defined!
ru: Не задана исходная система координат!

source: Get feature count
ru: Получение количества записей

source: Remove field 'ogc_fid' from input data
ru: Удаление поля 'ogc_fid' из входных данных

source: Check if features geometry is the type of %s
ru: Проверка типа геометрии %s

source: Force geometry field to %s
ru: Преобразование поля геометрии к %s

source: Input data is invalid: unsuported filter
ru: Неверные входные данные: фильтр не поддерживается

source: The driver '%s' is not available! OGR error:
ru: Драйвер '%s' недоступен! Ошибка OGR:

source: Datasource open failed! OGR error:
ru: Не удалось открыть источник данных! Ошибка OGR:

source: DXF layer does not support arbitrary field creation.
ru: Слой DXF не поддерживает создание полей.

source: Unsupported type for shape file - OFTTime. Change to OFTString.
ru: Тип данных OFTTime не поддерживается файлом ESRI shape. Изменен на OFTString.

source: Unsupported type for dbf file - OFTTime. Change to OFTString.
ru: Тип данных OFTTime не поддерживается файлом dbf. Изменен на OFTString.

source: Error (%d): %s
ru: Ошибка (%d): %s

source: Task Manager Server start failed. Path '%s'
ru: Не удалось запустить сервер менеждера задач. Путь '%s'

source: Conversion Tools
ru: Инструменты преобразования

source: Vector
ru: Вектор

source: Data Management Tools
ru: Управление данными

source: Raster
ru: Растр

source: Statistics Tools
ru: Статистические инструменты
